In [1]:
import numpy as np
import pandas as pd

# Strings

In [2]:
names = pd.Series(['andrew','bob','claire','david','5'])

In [3]:
names

0    andrew
1       bob
2    claire
3     david
4         5
dtype: object

In [4]:
names.str.upper()

0    ANDREW
1       BOB
2    CLAIRE
3     DAVID
4         5
dtype: object

In [5]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [6]:
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']

In [7]:
tickers = pd.Series(tech_finance)

In [8]:
tickers

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [10]:
tickers.str.split(',',expand=True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [11]:
messy_names = pd.Series(['andrew ', "bo;bo", '   claire'])

In [12]:
messy_names.str.replace(';','').str.strip().str.capitalize()

0    Andrew
1      Bobo
2    Claire
dtype: object

# Datetime

In [13]:
from datetime import datetime

In [19]:
myyear = 2015
mymonth = 1
myday = 1
mymin = 30
myhour = 2
mysec = 15

In [16]:
mydate = datetime(myyear,mymonth,myday)

In [18]:
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [21]:
mydatetime = datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [22]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [23]:
mydatetime.year

2015

In [24]:
myser = pd.Series(["Nov 3, 1990", "2000-01-01",None])

In [25]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [28]:
timeser = pd.to_datetime(myser, format='mixed')

In [29]:
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [30]:
timeser[0].year

1990

In [31]:
obvi_euro_date = "31-12-2000"

In [34]:
pd.to_datetime(obvi_euro_date)

/var/folders/_f/vp7vj3vs4130dbp40v081d7c0000gn/T/ipykernel_85697/163700324.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [36]:
euro_date = "10-12-2000"
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [37]:
style_date = "12--Dec--2000"

In [38]:
pd.to_datetime(style_date, format="%d--%b--%Y")

Timestamp('2000-12-12 00:00:00')

In [39]:
custom_date = "12th of Dec 2000"
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [40]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [41]:
sales.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [43]:
sales["DATE"] = pd.to_datetime(sales["DATE"])
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [44]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0])

In [45]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [48]:
sales.set_index("DATE", inplace=True)

When calling `.resample()` you first need to pass in a **rule** parameter, then you need to call some sort of aggregation function.

The **rule** parameter describes the frequency with which to apply the aggregation function (daily, monthly, yearly, etc.)<br>
It is passed in using an "offset alias" - refer to the table below. [[reference](http://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases)]

The aggregation function is needed because, due to resampling, we need some sort of mathematical rule to join the rows (mean, sum, count, etc.)

In [49]:
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [50]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0])

In [51]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [52]:
sales["DATE"].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int32